{
    "errors": {
        "400": "Invalid data input. - Error response contains propertyName or parameterName property, that provides the name of a request property that caused the error.",
        "401": "To perform the requested operation, authorization is required.",
        "403": "Access to the requested resource is forbidden.",
        "404": "Requested resource does not exist. - message property of an error response contains the name of the ,missing resource.",
        "409": "Creation or modification of a resource cannot be performed due to conflicts with a resource that ,already exists.",
        "415": "To perform the requested operation, a different content type is required.",
        "429": "Number of requests exceeds throttling limitations. - For details on throttling limitations, see ,Throttling Settings.",
        "500": "Unspecified cause of error.",
        "504": "REST API failed to access Veeam Service Provider Console server.",
        "1000": "Requested operation cannot be performed at the moment. - message property of an error response ,contains the information about a cause of limitation.",
        "1001": "JSON Patch modifications failed to apply.",
        "1050": "Requested task has been canceled by a user.",
        "1051": "Requested task took too long to execute.",
        "1100": "Specified user does not exist.",
        "1101": "Requested operation requires functionality that is disabled by a service provider.",
        "1200": "Specified identity provider does not exist.",
        "1201": "User identity cannot be assigned to the specified user.",
        "1202": "Provided key is already assigned to a different user.",
        "1203": "Provided key is protected with password and cannot be used in the requested operation.",
        "1204": "Non-RSA keys are not supported for asymmetric authentication.",
        "1205": "Format of the provided key is not supported.",
        "1206": "Specified identity provider is disabled.",
        "1207": "Specified TOTP code is invalid.",
        "1208": "Specified MFA answer is invalid.",
        "1209": "The specified scope cannot be assigned.",
        "1210": "Container does not include a private key.",
        "1250": "IdP with the specified name already exists.",
        "1251": "Operations on IdP are unavailable while Veeam Service Provider Console portal is in the maintenance ,mode.",
        "1252": "IdP with the specified display name is already configured for the organization.",
        "1253": "Veeam Service Provider Console failed to receive metadata from IdP.",
        "1254": "Veeam Service Provider Console failed to process metadata received from IdP.",
        "1255": "IdP creation or modification failed.",
        "1300": "Requested operation on the specified license failed to execute.",
        "1301": "Requested operation on the specified license is already in progress.",
        "1500": "Specified location cannot be deleted because a company must have at least one assigned location.",
        "3000": "Deployment task failed to execute.",
        "3001": "Deployment task initiated by the request already exists.",
        "4000": "Version of a managed agent is outdated.",
        "4001": "Veeam CBT driver does not support the guest OS.",
        "4002": "Management agent is busy and cannot perform the requested operation.",
        "5000": "Version of a Veeam backup agent is outdated.",
        "5001": "Veeam backup agent cannot be patched or updated because it is already up-to-date.",
        "5002": "Veeam backup agent cannot be found right now and a data collection session is initiated to find that ,agent.",
        "5003": "Veeam backup agent cannot be found on a computer.",
        "5004": "Veeam backup agent management mode is currently changing and is not yet set to managed.",
        "5005": "Veeam backup agent is not managed by Veeam Service Provider Console.",
        "5006": "Veeam CBT driver is not compatible with the Workstation agent mode.",
        "5007": "Veeam CBT driver cannot be installed due to outdated Veeam backup agent version.",
        "5008": "Veeam CBT driver is already installed on the computer.",
        "5009": "Veeam CBT driver is not installed and cannot be deleted.",
        "6000": "No job or policy is configured for the Veeam backup agent.",
        "7000": "Veeam ONE version is outdated.",
        "9000": "Failover to a future date cannot be performed."
    }
}